spicahan/qrp_companion/sdkconfig.defaults
# Target: ESP32-P4 (M5Stack Tab5)
CONFIG_IDF_TARGET="esp32p4"

# Required for 200MHz PSRAM
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# PSRAM (required by M5GFX for Tab5)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# Place malloc in PSRAM when internal memory is exhausted
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# USB Host for UAC audio input
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048

# WiFi AP for web UI (ESP32-P4 uses esp_wifi_remote + esp_hosted via C6)
# Do NOT set CONFIG_ESP_HOST_WIFI_ENABLED — it conflicts with esp_wifi_remote
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_LWIP_LOCAL_HOSTNAME="qrp-companion"

# ESP-Hosted SDIO transport (Tab5: P4 ↔ C6 via SDIO 4-bit @ 40MHz)
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
